app/views/users/likes.html.erb

SELECT COUNT(*) FROM "posts" INNER JOIN "likes" ON "posts"."id" = "likes"."post_id" WHERE "likes"."user_id" = ?  [["user_id", 1]]
---
    <ul class="user-tabs">
    <li><%= link_to "投稿(#{@user.posts.count})", @user %></li>