app/views/users/show.html.erb

SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
    <div class="btn-group" role="group" aria-label="Basic example">
      <%= link_to "投稿(#{@user.posts.count})", @user, class: "active btn btn-primary", role: "button" %>
      <%= link_to "いいね!(#{@user.liked_posts.count})", "/users/#{@user.id}/likes", class: "btn btn-success", role: "button" %>