app/views/posts/show.html.erb

      <%= link_to post_like_path(@post), method: :delete do %>
        <i class="fas fa-thumbs-up"><%= @post.likes.count %></i>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 2]]

      <%= link_to post_likes_path(@post), method: :post do %>
        <i class="far fa-thumbs-up"><%= @post.likes.count %></i>
---
SELECT COUNT(*) FROM "likes" WHERE "likes"."post_id" = ?  [["post_id", 1]]