app/controllers/posts_controller.rb

  def index
    @posts = Post.paginate(page: params[:page], per_page: 9)
---
SELECT COUNT(*) FROM "posts"

  def create
    @post = current_user.posts.build(post_params)
    @post.image.attach(params[:post][:image])
---
INSERT INTO "posts" ("name", "price", "store", "address", "image", "comment", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    @post = Post.find(params[:id])
    if @post.update(post_params)
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
UPDATE "posts" SET "name" = ?, "image" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["name", "シフォンケーキ"], ["image", "sweet.jpg"], ["updated_at", "2020-09-23 07:40:42.395666"], ["id", 7]]

  def destroy
    Post.find(params[:id]).destroy
---
DELETE FROM "posts" WHERE "posts"."id" = ?  [["id", 15]]
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT ?  [["id", 15], ["LIMIT", 1]]