app/controllers/users_controller.rb

SELECT "users".* FROM "users" WHERE "users"."activated" = ? LIMIT ? OFFSET ?  [["activated", 1], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "users" WHERE "users"."activated" = ?  [["activated", 1]]
---
  def index
    @users = User.where(activated: true).paginate(page: params[:page])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? LIMIT ? OFFSET ?  [["user_id", 1], ["LIMIT", 30], ["OFFSET", 0]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 1]]
---
  def show
    @user = User.find(params[:id])
    @posts = @user.posts.paginate(page: params[:page])

INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @user = User.new(user_params)
    @user.avatar.attach(params[:user][:avatar])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
UPDATE "users" SET "avatar" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["avatar", "avatar.jpg"], ["updated_at", "2020-09-25 13:16:08.675653"], ["id", 1]]
INSERT INTO "users" ("name", "email", "created_at", "updated_at", "password_digest", "activation_digest") VALUES (?, ?, ?, ?, ?, ?)
---
  def update
    @user = User.find(params[:id])
    if @user.update(user_params)
      @user.avatar.attach(params[:user][:avatar])

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "likes".* FROM "likes" WHERE "likes"."user_id" = ? LIMIT ?  [["user_id", 1], ["LIMIT", 11]]
---
  def likes
    @user = User.find(params[:id])
    @posts = @user.liked_posts.paginate(page: params[:page])